# ユーザーを作成することができる - user/update/success
tags: sequential

## ユーザーの名前を更新できる
* ユーザー"7895cf5a-9986-454a-942a-e1c0dc16f818"の"success/name"の更新のリクエストをする
* ユーザー"7895cf5a-9986-454a-942a-e1c0dc16f818"のnameが"田中たろう"に更新されている

## ユーザーのメールアドレスを更新できる
* ユーザー"7895cf5a-9986-454a-942a-e1c0dc16f818"の"success/mail"の更新のリクエストをする
* ユーザー"7895cf5a-9986-454a-942a-e1c0dc16f818"のmailが"jiro2@gmail.com"に更新されている

## ユーザーの情報を更新できる
* ユーザー"7895cf5a-9986-454a-942a-e1c0dc16f818"の"success/user"の更新のリクエストをする
* ユーザー"7895cf5a-9986-454a-942a-e1c0dc16f818"のnameが"Tanaka Shota"に更新されている
* ユーザー"7895cf5a-9986-454a-942a-e1c0dc16f818"のmailが"test99@gmail.com"に更新されている

## 指定したユーザーの情報のみを更新できる
* ユーザー"7895cf5a-9986-454a-942a-e1c0dc16f818"の"success/user"の更新のリクエストをする
* "users"の更新がされたレコードが"1"つである
